name: "resnet50_3"
backend: "onnxruntime"

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 1, 3, 224, 224 ]
  }
]

output [
  {
    name: "output_3"
    data_type: TYPE_FP32
    dims: [1, 1000]
  }
]


# The usage of device is deferred to the vLLM engine
instance_group [
  {
    count: 1
    kind: KIND_MODEL
  }
]