name: "whisper-large-v3"
backend: "python"

input [
    {
        name: "INPUT"
        data_type: TYPE_FP32
        dims: [1, -1]
    }
]
output [
    {
        name: "OUTPUT"
        data_type: TYPE_STRING
        dims: [-1]
    }
]

dynamic_batching {
    max_queue_delay_microseconds: 100
}

instance_group [
    {
        count: 1
        kind: KIND_MODEL
    }
]