name: "all-distilroberta-v1"
backend: "python"

input [
    {
        name: "INPUT"
        data_type: TYPE_STRING
        dims:  [1]
    }
]
output [
    {
        name: "OUTPUT"
        data_type: TYPE_FP32
        dims: [1, 768]
    }
]


instance_group [
    {
        count: 1
        kind: KIND_MODEL
    }
]