name: "ensemble-model"
platform: "ensemble"

# Input to the model 
input [
   {
        name: "image"
        data_type: TYPE_FP32
        dims: [1, 3, 224, 224] 
    }
]

# Output of the model 
output [
    {
        name: "final_output"
        data_type: TYPE_STRING
        dims: [-1, 1]
    }
]

# Type of scheduler to be used
ensemble_scheduling {
    step [
        {
            model_name: "resnet50"
            model_version: -1
            input_map {
                key: "input"
                value: "image"
            }
            output_map {
                key: "output"
                value: "output"
            }
        },
        {
            model_name: "resnet50_2"
            model_version: -1
            input_map {
                key: "input"
                value: "image"
            }
            output_map {
                key: "output_2"
                value: "output_2"
            }
        },
        {
            model_name: "resnet50_3"
            model_version: -1
            input_map {
                key: "input"
                value: "image"
            }
            output_map {
                key: "output_3"
                value: "output_3"
            }
        },        
        {
            model_name: "finalizer"
            model_version: -1
            input_map [
                {
                    key: "output_classifier_1"
                    value: "output"
                },
                {
                    key: "output_classifier_2"
                    value: "output_2"
                },
                {
                    key: "output_classifier_3"
                    value: "output_3"
                }
            ]
            output_map {
                key: "final_output"
                value: "final_output"
            }
        }
    ]
}
